{
  "<ACTION_0>": 151649,
  "<ACTION_100>": 151749,
  "<ACTION_101>": 151750,
  "<ACTION_102>": 151751,
  "<ACTION_103>": 151752,
  "<ACTION_104>": 151753,
  "<ACTION_105>": 151754,
  "<ACTION_106>": 151755,
  "<ACTION_107>": 151756,
  "<ACTION_108>": 151757,
  "<ACTION_109>": 151758,
  "<ACTION_10>": 151659,
  "<ACTION_110>": 151759,
  "<ACTION_111>": 151760,
  "<ACTION_112>": 151761,
  "<ACTION_113>": 151762,
  "<ACTION_114>": 151763,
  "<ACTION_115>": 151764,
  "<ACTION_116>": 151765,
  "<ACTION_117>": 151766,
  "<ACTION_118>": 151767,
  "<ACTION_119>": 151768,
  "<ACTION_11>": 151660,
  "<ACTION_120>": 151769,
  "<ACTION_121>": 151770,
  "<ACTION_122>": 151771,
  "<ACTION_123>": 151772,
  "<ACTION_124>": 151773,
  "<ACTION_125>": 151774,
  "<ACTION_126>": 151775,
  "<ACTION_127>": 151776,
  "<ACTION_12>": 151661,
  "<ACTION_13>": 151662,
  "<ACTION_14>": 151663,
  "<ACTION_15>": 151664,
  "<ACTION_16>": 151665,
  "<ACTION_17>": 151666,
  "<ACTION_18>": 151667,
  "<ACTION_19>": 151668,
  "<ACTION_1>": 151650,
  "<ACTION_20>": 151669,
  "<ACTION_21>": 151670,
  "<ACTION_22>": 151671,
  "<ACTION_23>": 151672,
  "<ACTION_24>": 151673,
  "<ACTION_25>": 151674,
  "<ACTION_26>": 151675,
  "<ACTION_27>": 151676,
  "<ACTION_28>": 151677,
  "<ACTION_29>": 151678,
  "<ACTION_2>": 151651,
  "<ACTION_30>": 151679,
  "<ACTION_31>": 151680,
  "<ACTION_32>": 151681,
  "<ACTION_33>": 151682,
  "<ACTION_34>": 151683,
  "<ACTION_35>": 151684,
  "<ACTION_36>": 151685,
  "<ACTION_37>": 151686,
  "<ACTION_38>": 151687,
  "<ACTION_39>": 151688,
  "<ACTION_3>": 151652,
  "<ACTION_40>": 151689,
  "<ACTION_41>": 151690,
  "<ACTION_42>": 151691,
  "<ACTION_43>": 151692,
  "<ACTION_44>": 151693,
  "<ACTION_45>": 151694,
  "<ACTION_46>": 151695,
  "<ACTION_47>": 151696,
  "<ACTION_48>": 151697,
  "<ACTION_49>": 151698,
  "<ACTION_4>": 151653,
  "<ACTION_50>": 151699,
  "<ACTION_51>": 151700,
  "<ACTION_52>": 151701,
  "<ACTION_53>": 151702,
  "<ACTION_54>": 151703,
  "<ACTION_55>": 151704,
  "<ACTION_56>": 151705,
  "<ACTION_57>": 151706,
  "<ACTION_58>": 151707,
  "<ACTION_59>": 151708,
  "<ACTION_5>": 151654,
  "<ACTION_60>": 151709,
  "<ACTION_61>": 151710,
  "<ACTION_62>": 151711,
  "<ACTION_63>": 151712,
  "<ACTION_64>": 151713,
  "<ACTION_65>": 151714,
  "<ACTION_66>": 151715,
  "<ACTION_67>": 151716,
  "<ACTION_68>": 151717,
  "<ACTION_69>": 151718,
  "<ACTION_6>": 151655,
  "<ACTION_70>": 151719,
  "<ACTION_71>": 151720,
  "<ACTION_72>": 151721,
  "<ACTION_73>": 151722,
  "<ACTION_74>": 151723,
  "<ACTION_75>": 151724,
  "<ACTION_76>": 151725,
  "<ACTION_77>": 151726,
  "<ACTION_78>": 151727,
  "<ACTION_79>": 151728,
  "<ACTION_7>": 151656,
  "<ACTION_80>": 151729,
  "<ACTION_81>": 151730,
  "<ACTION_82>": 151731,
  "<ACTION_83>": 151732,
  "<ACTION_84>": 151733,
  "<ACTION_85>": 151734,
  "<ACTION_86>": 151735,
  "<ACTION_87>": 151736,
  "<ACTION_88>": 151737,
  "<ACTION_89>": 151738,
  "<ACTION_8>": 151657,
  "<ACTION_90>": 151739,
  "<ACTION_91>": 151740,
  "<ACTION_92>": 151741,
  "<ACTION_93>": 151742,
  "<ACTION_94>": 151743,
  "<ACTION_95>": 151744,
  "<ACTION_96>": 151745,
  "<ACTION_97>": 151746,
  "<ACTION_98>": 151747,
  "<ACTION_99>": 151748,
  "<ACTION_9>": 151658,
  "<end_of_utterance>": 151648,
  "<fake_token_around_image>": 151646,
  "<image>": 151647,
  "<|endoftext|>": 151643,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644
}
